{
  "about": [
    {
      "name": "Sivanantham Sinthujan",
      "role": "Digital Product Designer & Webentwickler in Ausbildung",
      "bio": [
        " 2010 habe ich meine Ausbildung als Koch absolviert. Seit 2015 - 2024 war ich selbständig. Auf der Suche nach einer neuen Perspektive fand ich die Umschulung beim Syntax Institut, die perfekt zu meiner Leidenschaft für Gestaltung und Technik passte.",
        "Während der Ausbildung zum Digital Product Designer lernte ich Themen wie Farbe, Typografie, Designprinzipien, Konkurrenz- & Anforderungsanalyse, Wireframes, Prototypen, Animationen, Microinteraktionen, Informationsarchitektur, Personas, User Flows und Projektplanung mit Scrum kennen. Außerdem arbeitete ich intensiv mit Tools wie Figma und Framer.",
        "Nach meinem erfolgreichen IHK-Abschluss als Digital Product Designer habe ich mit der Einführung in Software- und Webentwicklung begonnen. Ich habe Kenntnisse in HTML, CSS, Bootstrap, Responsive Design, JavaScript, API-Integration, Versionsverwaltung (Git) erworben und lerne aktuell React, Tailwind CSS, TypeScript und Backend-Entwicklung.",
        "Ich liebe es, zu verstehen, wie aus Code und Design funktionierende digitale Produkte entstehen – klar, nutzerfreundlich und mit Liebe zum Detail."
      ],
      "photo": "/src/assets/Profile.png",
      "location": "02324",
      "email": "Sinthujan@example.com",
      "social": [
        { 
          "name": "LinkedIn", 
          "url": "#",
          "icon": "linkedin"
        },
        { 
          "name": "GitHub", 
          "url": "#",
          "icon": "github"
        }
      ],
      "attributes": [
        {
          "title": "Kreativ",
          "description": "Leidenschaft für visuelles Design und ästhetische Lösungen"
        },
        {
          "title": "Lernbereit",
          "description": "Stetige Weiterentwicklung in Design und Entwicklung"
        },
        {
          "title": "Detailorientiert",
          "description": "Hohe Wertschätzung für sauberen Code und durchdachtes Design"
        },
        {
          "title": "Problemlöser",
          "description": "Analytische Herangehensweise an komplexe Herausforderungen"
        }
      ]
    }
  ]
}