{
  "about": [
    {
      "name": "Sivanantham Sinthujan",
      "role": "Digital Product Designer & Web Developer in Training",
      "bio": [
        "In 2010, I completed my training as a chef. From 2015 to 2024, I was self-employed. Searching for a new perspective, I found the retraining program at the Syntax Institute, which perfectly matched my passion for design and technology.",
        "During the training as a Digital Product Designer, I learned topics such as color, typography, design principles, competitor & requirements analysis, wireframes, prototypes, animations, microinteractions, information architecture, personas, user flows, and project planning with Scrum. I also worked extensively with tools like Figma and Framer.",
        "After successfully completing my IHK certification as a Digital Product Designer, I began an introduction to software and web development. I acquired skills in HTML, CSS, Bootstrap, responsive design, JavaScript, API integration, version control (Git), and I am currently learning React, Tailwind CSS, TypeScript, and backend development.",
        "I love understanding how functional digital products are created from code and design – clear, user-friendly, and with attention to detail."
      ],
      "photo": "/src/assets/Profile.png",
      "location": "02324",
      "url": "/.src/pages/Contact.jsx",
      "social": [
        { 
          "name": "LinkedIn", 
          "url": "#",
          "icon": "linkedin"
        },
        { 
          "name": "GitHub", 
          "url": "#",
          "icon": "github"
        }
      ],
      "attributes": [
        {
          "title": "Creative",
          "description": "Passion for visual design and aesthetic solutions"
        },
        {
          "title": "Eager to Learn",
          "description": "Continuous development in design and development"
        },
        {
          "title": "Detail-Oriented",
          "description": "High appreciation for clean code and thoughtful design"
        },
        {
          "title": "Problem Solver",
          "description": "Analytical approach to complex challenges"
        }
      ]
    }
  ]
}